/* Вам необхідно вказати, яким буде результат операції та описати крок за кроком у вигляді коментарів, як відбувається перетворення в кожному прикладі:


'number' + 3 + 3

null + 3

5 && "qwerty"

+'40' + +'2' + "hillel";

'10' - 5 === 6;

true + false

'4px' - 3

'4' - 3

'6' + 3 ** 0;

12 / '6'

'10' + (5 === 6);

null == ''

3 ** (9 / 3);

!!'false' == !!'true'

0 || '0' && 1

(+null == false) < 1;

false && true || true

false && (false || true);

(+null == false) < 1 ** 5;

*/



//  1) 'number' + 3 + 3

let task1 = 'number' + 3 + 3
console.log('1. result is - ' + task1)   // результат -  number33

//  Об'єднання рядків (конкатенація) -  string 'number' і неявно перетворених number 3  в  '3'


// 2) null + 3

let task2 = null + 3
console.log('2. result is - ' + task2)   // результат -  3

// додавання null((неявне перетворення в 0) до 3


// 3)   5 && "qwerty"

let task3 = 5 && "qwerty"
console.log('3. result is - ' + task3)   // результат -  qwerty



// 4)  +'40' + +'2' + "hillel";

let task4 = +'40' + +'2' + "hillel";
console.log('4. result is - ' + task4)   // результат -  42hillel


/*   <<В JavaScript унарний плюс (+) не має особливого впливу на числа. 
Це означає, що застосування унарного плюса перед числом не змінює його значення.
Однак, унарний плюс виконує перетворення до числа (coercion) для значень, які не є числами. >> 

Тому - +'40' + +'2' + "hillel"; - плюс попереду перетворить '40' і '2' на числа, просумує їх 40+2=42 і далі конкатенація з рядком "hillel" */



// 5) '10' - 5 === 6;

let task5 = '10' - 5 === 6;
console.log('5. result is - ' + task5)   // результат -  false

// '10' перетворюється в numberб тоож 10-5 = 5 і це не дорівнює 6, тож false


// 6) true + false

let task6 = true + false
console.log('6. result is - ' + task6)   // результат -  1

// true і false для додавання перетворюються в 1+0 = 1



// 7) '4px' - 3

let task7 = '4px' - 3
console.log('7. result is - ' + task7)   // результат -  NaN

// '4px' - рядок який не може бути перетворений в number, тож віднімання не може бути здійснене, тож результат - не число




// 8) '4' - 3

let task8 = '4' - 3
console.log('8. result is - ' + task8)   // результат -  1

// '4' - рядок який  може бути перетворений в number, тож віднімання відбувається , 4-3=1




// 9) '6' + 3 ** 0;

let task9 = '6' + 3 ** 0;
console.log('9. result is - ' + task9)   // результат -  61

// відбувається конкатенація з рядком '6', а піднімання в степінь 3 в 0й степені = 1
// (?) чому не відбувається перетворення  '6' на number ? може тому що першим іде рядок, тож автоматично включається конкатенація ?



// 10) 12 / '6'

let task10 = 12 / '6'
console.log('10. result is - ' + task10)   // результат -  2

// відбувається неявне перетворення '6' в number і ділення , 12/6=2








/*

'10' + (5 === 6);

null == ''

3 ** (9 / 3);

!!'false' == !!'true'

0 || '0' && 1

(+null == false) < 1;

false && true || true

false && (false || true);

(+null == false) < 1 ** 5;   */